{
	"modals": {
		"mailer_title": "Sélection de la messagerie",
		"mailer_description": "Pour envoyer un courriel, vous avez le choix entre plusieurs messageries. Sélectionnez celle de votre choix.",
		"mailer_error": "Vous devez choisir une messagerie.",
		"mailer_google": "Gmail (Google)",
		"mailer_default": "Messagerie par défaut"
	},
	"projects":
	{
		"portfolio": "C'est le site où vous vous trouvez actuellement, c'est un simple portfolio sous forme d'un site Internet, il décrit toutes mes compétences mais également les projets que j'ai réalisé à travers le temps (personnels, scolaires ou professionnels).",
		"filestorage": "Un service de stockage de données simple d'utilisation, sécurisé et rapide permettant de s'émanciper des grands acteurs actuels comme Google Drive ou OneDrive ayant des politiques de confidentialité douteuses.",
		"sourceconsole": "Un service d'administration à distance de serveurs exécutant le moteur Source (Garry's Mod, Counter-Strike: Source, Team Fortress 2, etc.) pour les administrateurs de serveurs inexpérimentés ou les personnes n'ayant pas accès à la console du serveur.",
		"mangaparadise": "Un site vitrine conçu bénévolement pour l'association Manga Paradise, une association de passionnés de mangas et de culture japonaise. Le site a été conçu dans le but de remplacer leur ancien site qui était obsolète et qui n'était plus maintenu.",
		"homepage": "Une page d'accueil conçue dans le style d'un terminal de commande, servant de passerelle vers mon portfolio et permettant d'accéder aux liens vers mes différents projets personnels. Le site est évidemment conçu pour une utilisation sur un ordinateur et n'est pas adapté pour un appareil mobile.",
		"ravenshortener": "Un raccourcisseur de liens Internet conçu pour être simple d'utilisation, intrinsèquement sécurisé et entièrement personnalisable, mettant un accent particulier sur la protection de la vie privée et offrant une API totalement indépendante.",
		"onlineresume": "Un curriculum vitæ (CV) en ligne conçu pour être dynamique, personnalisable et parfaitement adaptable à tous les supports, quel que soit l'appareil ou le format d'affichage, afin de mettre en valeur les informations essentielles pour les recruteurs.",
		"timeloop": "Un compte à rebours pour estimer le temps restant avant une date future, ou mesurer le temps écoulé depuis une date passée pour ne jamais oublier à quel point le temps file. Le site permet également de sélectionner des événements historiques marquants afin de mieux visualiser l'écoulement du temps."
	},
	"landing": {
		"scroll_top": "Remonter en haut de la page",
		"header_projects": "Projets",
		"header_skills": "Compétences",
		"header_contact": "Contact",
		"header_theme": "Changement de thème",
		"header_navigation": "Menu de navigation",
		"project_source": "Code source",
		"project_demo": "Démonstration",
		"footer_mail": "Courriel",
		"filter_all": "Toutes",
		"filter_front": "Front-end",
		"filter_back": "Back-end",
		"filter_other": "Autres",
		"footer_legacy": "<a>Version classique</a>",
		"footer_madeby": "Conçu par <a>Florian Trayon 🐈</a>",
		"developer_firstname": "Florian",
		"developer_surname": "Trayon",
		"developer_description": "Je suis un développeur (junior) français full-stack de {age} ans. J'adore utiliser mes heures perdues pour développer des projets personnels de toutes sortes. Passionné par l'informatique, je suis toujours à la recherche de nouvelles technologies et de nouveaux projets.",
		"hello_title": "Bonjour. Je suis",
		"access_resume": "Accéder au C.V en ligne",
		"japanese_credits": "✨ Fièrement traduit en Japonais par <a>Zélie Exposito</a> 🎌"
	}
}